{
  "posts": [
    {
      "title": "Объекты",
      "link": "",
      "text": "Объекты — это составные структуры. Для них можно определить именованные свойства, в каждом из которых может содержаться значение любого типа.\n",
      "type": "history",
      "id": 3
    },
    {
      "title": "Для чего используется директива «use strict»?",
      "link": "",
      "text": "«use strict» — это директива ES5, которая заставляет весь наш код или код отдельной функции выполняться в строгом режиме. Строгий режим вводит некоторые ограничения по написанию кода, тем самым позволяя избегать ошибок на ранних этапах",
      "type": "history",
      "id": 4
    },
    {
      "title": "Что такое map и set",
      "link": "https://learn.javascript.ru/map-set",
      "text": "Map – это коллекция ключ/значение, как и Object. Но основное отличие в том, что Map позволяет использовать ключи любого типа.",
      "type": "programming",
      "id": 5
    },
    {
      "title": "Пассионарии",
      "link": "",
      "text": "Это предприимчивые, активные и рисковые люди, стремящиеся к выполнению поставленной задачи, преодолевающие страх смерти.",
      "type": "other",
      "date": "2020-09-07T09:34:08.633Z",
      "id": 6
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста\nТекст поста\nТекст поста\nПо сути мы реализовали все необходимое для успешного создания модальных окон, осталось ещё несколько дел:\n\nПроблема №9. В IE11 не работают методы Element.closest() и Object.assign().\n\nДля поддержки Element.closest, воспользуемся полифилами для closest и matches от MDN.\n\nМожно их вставить просто так, но так как у нас проект всё равно собирается webpack, то удобно воспользоваться пакетом element-closest-polyfill который просто вставляет этот код.\n\nДля поддержки Object.assign, можно воспользоваться уже babel-плагином @babel/plugin-transform-object-assign\n\n3. Заключение и ссылки\n\nПовторяя начало статьи, всё изложенное выше, я оформил в маленькую библиотеку hystModal под MIT-лицензией. Вышло 3 кБ кода при загрузке с gzip. Ещё написал для неё подробную документацию на русском и английском языке.\n\nЧто вошло ещё в библиотеку hystModal, чего не было в статье:\n\nНастройки (вкл/выкл управление фокусом, варианты закрытия, ожидание анимации закрытия)\nКоллбеки (функции вызывающиеся перед открытием окна и после его закрытия (в них передаётся объект модального окна))\nДобавлен запрет на какие-либо действия пока анимация закрытия окна не завершится, а также ожидание анимации закрытия текущего окна перед открытием нового (если окно открывается из другого окна).\nОформление кнопки-крестика закрытия в CSS\nМинификация CSS и JS плагинами Webpack.\n\nЕсли вам будет интересна эта библиотека, буду рад звёздочке в GitHub, или напишите в Issues о найденных багах. (Особенно большие проблемы, наверное, в грамматике английской версии документации, так как мои знания языка пока на начальном уровне. Связаться со мной также можно в Instagram\n\nТеги:\nМодальные окна\nмодальное окно\nhtml\ncss\njs\njavacript\nбиблиотека javascript\nlibrary\na11y\nдоступность\nвёрстка\nui/ux\nразработка сайтов\nХабы:\nРазработка веб-сайтов\nCSS\nJavaScript\nHTML\nAccessibility",
      "type": "other",
      "date": "2020-12-11T14:00:46.166Z",
      "id": 9
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста",
      "type": "other",
      "date": "2020-12-11T15:38:27.879Z",
      "id": 10
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста",
      "type": "other",
      "date": "2020-12-15T09:13:51.713Z",
      "id": 11
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста",
      "type": "other",
      "date": "2020-12-15T10:20:57.476Z",
      "id": 12
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста",
      "type": "other",
      "date": "2020-12-15T10:20:58.384Z",
      "id": 13
    },
    {
      "title": "Новый пост",
      "link": "",
      "text": "Текст поста",
      "type": "other",
      "date": "2020-12-15T10:20:58.673Z",
      "id": 14
    }
  ]
}